Repository: UniversidadDelEste/thinkcspy
Catalog: locale/*/LC_MESSAGES/index.po
Languages: es

source: An interactive version of the How to Think Like a Computer Scientist book
es: Versión interactiva y en español del libro "Cómo pensar como un Computador Científico", también conocido como "Aprenda a Pensar como un Programador (Python)"

source: python, introduction, computer science
es: python, introducción, ciencias de la computación, informática, programación

source: <div style="text-align:center" class="center-block"> <h1>How to Think Like a Computer Scientist: Interactive Edition</h1> <style> button.reveal_button { margin-left: auto; margin-right: auto; } </style> </div>
es: <div style="text-align:center" class="center-block"> <h1>Aprenda a pensar como un Programador</h1> <h2>Edición Interactiva en Español con Python</h2> <style> button.reveal_button { margin-left: auto; margin-right: auto; } </style> </div>

source: About this Project
es: Sobre este Proyecto

source: data-showtitle="About this Project"
es: data-showtitle="Acerca de este Proyecto"

source: This interactive book is a product of the `Runestone Interactive <http://runestoneinteractive.org>`_ Project at Luther College, led by `Brad Miller <http://reputablejournal.com>`_ and David Ranum. There have been many contributors to the project. Our thanks especially to the following:
es: Este libro interactivo es un producto del Proyecto `Runestone Interactive <http://runestoneinteractive.org>`_ en el Luther College, liderado por `Brad Miller <http://reputablejournal.com>`_ y David Ranum. El proyecto ha contado con muchos colaboradores. Nuestro agradecimiento especial para:

source: This book is based on the `Original work <http://www.openbookproject.net/thinkcs/python/english2e/>`_ by: Jeffrey Elkner, Allen B. Downey, and Chris Meyers
es: Este libro está basado en el `Trabajo original <http://www.openbookproject.net/thinkcs/python/english2e/>`_ de: Jeffrey Elkner, Allen B. Downey, y Chris Meyers. Adicionalmente, se utilizan traducciones de la versión en español "Aprenda a Pensar Como un Programador con Python" traducido por: Miguel Ángel Vilella, Ángel Arnal, Iván Juanes, Litza Amurrio, Efrain Andia, César Ballardini.

source: Activecode based on `Skulpt <http://skulpt.org>`_
es: Activecode basado en `Skulpt <http://skulpt.org>`_

source: Codelens based on `Online Python Tutor <http://www.pythontutor.com>`_
es: Codelens basado en `Online Python Tutor <http://www.pythontutor.com>`_

source: Many contributions from the `CSLearning4U research group <http://home.cc.gatech.edu/csl/CSLearning4U>`_ at Georgia Tech.
es: Varias contribuciones del `CSLearning4U research group <http://home.cc.gatech.edu/csl/CSLearning4U>`_ en el Georgia Tech.

source: ACM-SIGCSE for the special projects grant that funded our student Isaac Dontje Lindell for the summer of 2013.
es: ACM-SIGCSE por la beca especial al estudiante Isaac Dontje Lindell (2013).

source: The Runestone Interactive tools are open source and we encourage you to contact us, or grab a copy from GitHub if you would like to use them to write your own resources.
es: Las herramientas Runestone Interactive son de fuente abierta y los invitamos a contactarnos, u obtener una copia desde GitHub si desea usarlas para escribir sus propios materiales.

source: Table of Contents
es: Tabla de Contenidos

source: <ul> <li><a href="assignments.html">Assignments</a></li> </ul>
es: <ul> <li><a href="assignments.html">Tareas (Ejercicios)</a></li> </ul>

source: Labs
es: Ejercicios de Laboratorio

source: Appendices
es: Apendices

source: Acknowledgements
es: Reconocimientos

source: Indices and tables
es: Indices y tablas
