Repository: UniversidadDelEste/thinkcspy
Catalog: locale/*/LC_MESSAGES/GeneralIntro/Algorithms.po
Languages: es

source: Algorithms
es: Algoritmos

source: If problem solving is a central part of computer science, then the solutions that you create through the problem solving process are also important. In computer science, we refer to these solutions as **algorithms**. An algorithm is a step by step list of instructions that if followed exactly will solve the problem under consideration.
es: Si la resolución de problemas es una parte central de las ciencias de computación, entonces la soluciones que ud. crea a traves del proceso son también importantes. En ciencias de la computación, nos referimos a estas soluciones como **algoritmos**. Un algoritmo es una lista de instrucciones paso a paso, que si son seguidas exactamente, resolverán el problema en consideración.

source: Our goal in computer science is to take a problem and develop an algorithm that can serve as a general solution. Once we have such a solution, we can use our computer to automate the execution. As noted above, programming is a skill that allows a computer scientist to take an algorithm and represent it in a notation (a program) that can be followed by a computer. These programs are written in **programming languages**.
es: Nuestra meta en las ciencias de computación es tomar un problema y desarrollar un algoritmo que puede servir como una solución general. Una vez que tenemos dicha solución, podemos utilizar nuestra computadora para automatizar la ejecución. Como se notó anteriormente, la programación es una habilidad que permite a un científico de la computación tomar un algoritmo y representarlo en una notación (un programa) que puede ser seguida por una computadora. Estos programas son escritos en **lenguajes de programación**.

source: **Check your understanding**
es: **Verifique su entendimiento**

source: To think like a computer.
es: Pensar como una computadora.

source: To be able to write code really well.
es: Poder escribir código realmente bien.

source: To be able to solve problems.
es: Poder resolver problemas.

source: To be really good at math.
es: Ser muy bueno en matemáticas.

source: Computers do not think, they only do what we humans tell them to do via programs.
es: Las computadoras no piensan, solo hacen lo que los humanos les dicen que hagan via programas.

source: While it is necessary for most computer scientists to know how to write code, it is not the most important skill.
es: Mientras saber como escribir código es necesario para la mayor parte de los científicos en computación, no es la habilidad más importante.

source: Computer scientists are all about solving problems. We use computers to automate solutions to problems and to do things faster and more accurately than we can do by hand or manually.
es: Los cientificos en computación se centran en resolver problemas. Usamos computadoras para automatizar las soluciones a los problemas y para hacer las cosas más rápido y con más precisión que lo que podemos hacer manualmente.

source: Computer science and math are similar in many ways and it helps to have a strong mathematical foundation, but you do not have to be good at math to be a good computer scientist.
es: Las ciencias de computación y matemáticas son similares en muchos sentidos, y ayuda tener una base sólida en matemática, pero no tiene que ser bueno en matemáticas para ser bueno en computación.

source: intro-2-1: What is the most important skill for a computer scientist?
es: intro-2-1: ¿Cual es la habilidad más importante para un científico en computación?

source: A solution to a problem that can be solved by a computer.
es: Una solución a un problema que puede ser resuelta por una computadora.

source: A step by step list of instructions that if followed exactly will solve the problem under consideration.
es: Una lista de instrucciones paso a paso que si son seguidas exactamente resolverán el problema bajo consideración.

source: A series of instructions implemented in a programming language.
es: Una serie de instrucciones implementadas en un lenguaje de programación.

source: A special kind of notation used by computer scientists.
es: Un tipo de notación especial usado por los científicos de computación.

source: While it is true that algorithms often do solve problems, this is not the best answer. An algorithm is more than just the solution to the problem for a computer. An algorithm can be used to solve all sorts of problems, including those that have nothing to do with computers.
es: Mientras es verdad que los algoritmos usualmente resuleven problemas, esta no es la mejor respuesta. Un algoritmo es más que sólo la solución a un problema para una computadora. Un algoritmo puede ser usado para resolver todo tipo de problemas, incluyendo aquellos que no tienen nada que ver con computadoras.

source: Algorithms are like recipes: they must be followed exactly, they must be clear and unambiguous, and they must end.
es: Los algoritmos son como recetas: se deben seguir exactamente, deben ser claros y sin ambigüedades, y deben tener un final.

source: Programming languages are used to express algorithms, but an algorithm does not have to be expressed in terms of a programming language.
es: Los lenguajes de programación son utilizados para expresar los algoritmos, pero un algoritmo no tiene que ser expresado en términos de un lenguaje de programación.

source: Computer scientists sometimes use a special notation to illustrate or document an algorithm, but this is not the definition of an algorithm.
es: Los científicos en computación a veces usan una notación especial para ilustrar o documentar un algoritmo, pero esta no es la definición de un algoritmo.

source: intro-2-2: An algorithm is:
es: intro-2-2: Un algoritmo es:
